let paths = {
  'path16': '14',
  'path18': '14',
  'path20': '14',
  'path22': '14',
  'path24': '14',
  'path26': '14',
  'path28': '14',
  'path30': '14',
  'path32': '14',
  'path34': '14',
  'path36': '14',
  'path38': '87',
  'path40': '87',
  'path42': '41',
  'path44': '65',
  'path46': '65',
  'path48': '65',
  'path50': '65',
  'path52': '65',
  'path54': '65',
  'path56': '65',
  'path58': '65',
  'path60': '65',
  'path62': '65',
  'path64': '65',
  'path66': '41',
  'path68': '41',
  'path70': '49',
  'path72': '25',
  'path74': '27',
  'path76': '79',
  'path78': '28',
  'path80': '65',
  'path82': '36',
  'path84': '31',
  'path86': '46',
  'path88': '32',
  'path90': '67',
  'path92': '57',
  'path94': '48',
  'path96': '68',
  'path98': '71',
  'path100': '62',
  'path102': '40',
  'path104': '50',
  'path106': '33',
  'path108': '37',
  'path110': '44',
  'path112': '69',
  'path114': '76',
  'path116': '56',
  'path118': '64',
  'path120': '63',
  'path122': '73',
  'path124': '58',
  'path126': '13',
  'path128': '21',
  'path130': '53',
  'path132': '12',
  'path134': '16',
  'path136': '18',
  'path138': '2',
  'path140': '43',
  'path142': '89',
  'path144': '89',
  'path146': '89',
  'path148': '72',
  'path150': '45',
  'path152': '74',
  'path154': '66',
  'path156': '86',
  'path158': '53',
  'path160': '35',
  'path162': '60',
  'path164': '47',
  'path166': '51',
  'path168': '10',
  'path170': '11',
  'path172': '11',
  'path174': '83',
  'path176': '83',
  'path178': '83',
  'path180': '83',
  'path182': '83',
  'path184': '29',
  'path186': '29',
  'path188': '29',
  'path190': '29',
  'path192': '29',
  'path194': '29',
  'path196': '29',
  'path198': '29',
  'path200': '29',
  'path202': '29',
  'path204': '29',
  'path206': '29',
  'path208': '29',
  'path210': '29',
  'path212': '29',
  'path214': '29',
  'path216': '29',
  'path218': '39',
  'path220': '61',
  'path222': '34',
  'path224': '30',
  'path226': '8',
  'path228': '5',
  'path230': '20',
  'path232': '6',
  'path234': '15',
  'path236': '7',
  'path238': '9',
  'path240': '23',
  'path242': '26',
  'path244': '1',
  'path246': '3',
  'path248': '17',
  'path250': '4',
  'path252': '22',
  'path254': '54',
  'path256': '55',
  'path258': '70',
  'path260': '19',
  'path262': '84',
  'path264': '84',
  'path266': '84',
  'path268': '84',
  'path270': '84',
  'path272': '84',
  'path274': '84',
  'path276': '84',
  'path278': '84',
  'path280': '84',
  'path282': '84',
  'path284': '84',
  'path286': '84',
  'path288': '84',
  'path290': '84',
  'path292': '84',
  'path294': '84',
  'path296': '84',
  'path298': '84',
  'path300': '38',
  'path302': '85',
  'path304': '75',
  'path306': '80',
  'path308': '24',
  'path310': '41',
  'path312': '59',
  'path314': '82',
  'path316': '97'
};

let regions = {
  'region1': {
    'name': 'Республика Адыгея'
  },
  'region2': {
    'name': 'Республика Башкортостан'
  },
  'region3': {
    'name': 'Республика Бурятия'
  },
  'region4': {
    'name': 'Республика Алтай'
  },
  'region5': {
    'name': 'Республика Дагестан'
  },
  'region6': {
    'name': 'Республика Ингушетия'
  },
  'region7': {
    'name': 'Кабардино-Балкарская Республика'
  },
  'region8': {
    'name': 'Республика Калмыкия'
  },
  'region9': {
    'name': 'Карачаево-Черкесская Республика'
  },
  'region10': {
    'name': 'Республика Карелия'
  },
  'region11': {
    'name': 'Республика Коми'
  },
  'region12': {
    'name': 'Республика Марий Эл'
  },
  'region13': {
    'name': 'Республика Мордовия'
  },
  'region14': {
    'name': 'Республика Саха (Якутия)'
  },
  'region15': {
    'name': 'Республика Северная Осетия-Алания'
  },
  'region16': {
    'name': 'Республика Татарстан'
  },
  'region17': {
    'name': 'Республика Тува'
  },
  'region18': {
    'name': 'Удмуртская Республика'
  },
  'region19': {
    'name': 'Республика Хакасия'
  },
  'region20': {
    'name': 'Чеченская Республика'
  },
  'region21': {
    'name': 'Чувашская Республика'
  },
  'region22': {
    'name': 'Алтайский край'
  },
  'region23': {
    'name': 'Краснодарский край'
  },
  'region24': {
    'name': 'Красноярский край'
  },
  'region25': {
    'name': 'Приморский край'
  },
  'region26': {
    'name': 'Ставропольский край'
  },
  'region27': {
    'name': 'Хабаровский край'
  },
  'region28': {
    'name': 'Амурская область'
  },
  'region29': {
    'name': 'Архангельская область'
  },
  'region30': {
    'name': 'Астраханская область'
  },
  'region31': {
    'name': 'Белгородская область'
  },
  'region32': {
    'name': 'Брянская область'
  },
  'region33': {
    'name': 'Владимирская область'
  },
  'region34': {
    'name': 'Волгоградская область'
  },
  'region35': {
    'name': 'Вологодская область'
  },
  'region36': {
    'name': 'Воронежская область'
  },
  'region37': {
    'name': 'Ивановская область'
  },
  'region38': {
    'name': 'Иркутская область'
  },
  'region39': {
    'name': 'Калининградская область'
  },
  'region40': {
    'name': 'Калужская область'
  },
  'region41': {
    'name': 'Камчатская область'
  },
  'region42': {
    'name': 'Кемеровская область'
  },
  'region43': {
    'name': 'Кировская область'
  },
  'region44': {
    'name': 'Костромская область'
  },
  'region45': {
    'name': 'Курганская область'
  },
  'region46': {
    'name': 'Курская область'
  },
  'region47': {
    'name': 'Ленинградская область'
  },
  'region48': {
    'name': 'Липецкая область'
  },
  'region49': {
    'name': 'Магаданская область'
  },
  'region50': {
    'name': 'Московская область'
  },
  'region51': {
    'name': 'Мурманская область'
  },
  'region52': {
    'name': 'Нижегородская область'
  },
  'region53': {
    'name': 'Новгородская область'
  },
  'region54': {
    'name': 'Новосибирская область'
  },
  'region55': {
    'name': 'Омская область'
  },
  'region56': {
    'name': 'Оренбургская область'
  },
  'region57': {
    'name': 'Орловская область'
  },
  'region58': {
    'name': 'Пензенская область'
  },
  'region59': {
    'name': 'Пермская область'
  },
  'region60': {
    'name': 'Псковская область'
  },
  'region61': {
    'name': 'Ростовская область'
  },
  'region62': {
    'name': 'Рязанская область'
  },
  'region63': {
    'name': 'Самарская область'
  },
  'region64': {
    'name': 'Саратовская область'
  },
  'region65': {
    'name': 'Сахалинская область'
  },
  'region66': {
    'name': 'Свердловская область'
  },
  'region67': {
    'name': 'Смоленская область'
  },
  'region68': {
    'name': 'Тамбовская область'
  },
  'region69': {
    'name': 'Тверская область'
  },
  'region70': {
    'name': 'Томская область'
  },
  'region71': {
    'name': 'Тульская область'
  },
  'region72': {
    'name': 'Тюменская область'
  },
  'region73': {
    'name': 'Ульяновская область'
  },
  'region74': {
    'name': 'Челябинская область'
  },
  'region75': {
    'name': 'Читинская область'
  },
  'region76': {
    'name': 'Ярославская область'
  },
  'region77': {
    'name': 'Город Москва'
  },
  'region78': {
    'name': 'Город Санкт-Петербург'
  },
  'region79': {
    'name': 'Еврейская автономная область'
  },
  'region80': {
    'name': 'Агинский Бурятский автономный округ'
  },
  'region81': {
    'name': 'Коми Пермяцкий автономный округ'
  },
  'region82': {
    'name': 'КРЫМ'
  },
  'region83': {
    'name': 'Ненецкий автономный округ'
  },
  'region84': {
    'name': 'Таймырский (Долгано Ненецкий) автономный округ'
  },
  'region85': {
    'name': 'Усть Ордынский Бурятский автономный округ'
  },
  'region86': {
    'name': 'Ханты Мансийский автономный округ'
  },
  'region87': {
    'name': 'Чукотский автономный округ'
  },
  'region88': {
    'name': '[UNUSED]Эвенкийский автономный окру'
  },
  'region89': {
    'name': 'Ямало Ненецкий автономный округ'
  },
  'region90': {
    'name': 'Московская область'
  },
  'region92': {
    'name': '[UNUSED]Севастополь'
  },
  'region93': {
    'name': '[UNUSED]Краснодарский край'
  },
  'region94': {
    'name': '[UNUSED]Территории, находящиеся за пределами РФ и обслуживаемые Управлением режимных объектов МВД России'
  },
  'region95': {
    'name': '[UNUSED]Чеченская Республика'
  },
  'region96': {
    'name': '[UNUSED]Свердловская область'
  },
  'region97': {
    'name': '[UNUSED]Город Москва'
  },
  'region98': {
    'name': '[UNUSED]Город Санкт-Петербург'
  },
  'region99': {
    'name': '[UNUSED]Город Москва'
  }
}
